import React from 'react'
import './Try.css'


export default function Calneder1() {
  const customDays = [
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },

    { day: '১', content: '15 april', color: 'white' },
    { day: '২', content: 'april 16', color: 'white' },
    { day: '৩', content: 'april 17', color: 'white' },

    { day: '৪', content: 'april 18', color: 'white' },
    { day: '৫', content: 'april 19', color: 'white' },
    { day: '৬', content: 'april 20', color: 'white' },
    { day: '৭', content: 'april 21', color: 'white' },
    { day: '৮', content: 'april 22', color: 'white' },
    { day: '৯', content: 'april 23', color: 'white' },
    { day: '১০', content: 'april 24', color: 'white' },
    { day: '১১', content: 'april 25', color: 'white' },
    { day: '১২', content: 'april 26', color: 'white' },
    { day: '১৩', content: 'april 27', color: 'white' },
    { day: '১৪', content: 'april 28', color: 'white' },
    { day: '১৫', content: 'april 29', color: 'white' },
    { day: '১৬', content: 'april 30', color: 'white' },
    { day: '১৭', content: 'may 1 ', color: 'white' },
    { day: '১৮', content: 'may 2', color: 'white' },
    { day: '১৯', content: 'may 3', color: 'white' },
    { day: '২০', content: 'may 4', color: 'white' },
    { day: '২১', content: 'may 5', color: 'white' },
    { day: '২২', content: 'may 6', color: 'white' },
    { day: '২৩', content: 'may 7', color: 'white' },
    { day: '২৪', content: 'may 8', color: 'white' },
    { day: '২৫', content: 'may 9', color: 'white' },
    { day: '২৬', content: 'may 10', color: 'white' },
    { day: '২৭', content: 'may 11', color: 'white' },
    { day: '২৮', content: 'may 12', color: 'white' },
    { day: '২৯', content: 'may 13', color: 'white' },
    { day: '৩০', content: 'may 14', color: 'white' },
    { day: '৩১', content: 'may 15', color: 'white' },


    // ... Add more days as needed
  ];

  return (
 <>

        <div className="month">
       <ul>
         <li className="prev">&#10094;</li>
         <li className="next">&#10095;</li>
         <li>
           Aahar (April-May)<br />
           <span style={{ fontSize: '18px' }}>2023-24</span>
         </li>
       </ul>
     </div>

     <ul className="weekdays">
       <li>দেওবাৰ</li>
       <li>সোমবাৰ</li>
       <li>মঙলবাৰ</li>
       <li>বুধবাৰ</li>
       <li>বৃহস্পতিবাৰ</li>
       <li>শুকুৰবাৰ</li>
       <li>শনিবাৰ</li>

     
     </ul>

     <ul className="days">
       {customDays.map(({ day, content, color }) => (
         <li key={day} style={{ backgroundColor: color }}>
           {day}
           <div>{content}</div>
         </li>
       ))}
     </ul>
  



    <ul>
      <li>
১-নৱমাটি কাটনীপাৰ সত্ৰত যুগলনাথ আৰু চিদানন্দ দেৱৰ তিঃতিঃ।
 
 ২-আহতগুৰি সত্ৰত লক্ষীকান্ত দেব, পুখুৰীপাৰ সত্ৰৰ সত্ৰাধিকাৰ যোগেশ্বৰ গোস্বামী দেৱ, প্রাক্তন সত্ৰাধিকাৰ কুশল চন্দ্ৰ অধিকাৰী, ধৰ্মপ্ৰাণা মহিলা পার্বতী দত্তবৰুৱাৰ তিঃতিঃ, লেটুগ্রাম সত্রত দেবানন্দ আতা, আৰু পুখুৰীপাৰ সত্ৰৰ সত্যবর্তী আইৰ তিঃতিঃ। জ্যোতিপ্ৰসাদ আগৰৱালৰ জন্মদিৱস। ৪- কৰঙা লেটুগ্রাম সত্ৰত সত্ৰাধিকাৰ পূর্ণানন্দ মহন্তৰ তিঃতিঃ। 
 
 ৫-কলাগুৰু বিষ্ণুপ্ৰসাদ ৰাভাব স্মৃতি দিৱস। 
 
 ৬-পশ্চিম চামতাৰ নিৰঞ্জন শৰ্ম্মা, দৰং জিলাৰ দেওমৰনৈ বড়িগাঁৱৰ থানেশ্বৰ দেৱ শৰ্ম্মাৰ তিঃতিঃ।৭-বাঘ ৮।১৫।৩০ যোৱাত অম্বুবাচী প্রবৃত্তিঃ। মাঁ কামাখ্যা ধামত অম্বুবাচী মহামেলা আৰম্ভ। ঘণ্ডৱা (ডিগাক)ত মাল গোঁসাই পূজা।
 
  ৮-ভাটৌকুছিৰ কেশব চৰণ আতা, আদিএলেঙিৰ ডেকা অধিকাৰ দেবেন্দ্র নাথ মহন্ত আৰু মবিগাঁও চটাবড়ি শিলডুবি সত্ৰৰ সত্ৰাধিকাৰ ঈশ্বৰ চন্দ্ৰ গোস্বামীৰ তিঃতিঃ ।
  
  ৯-বিষ্ণু বালিকুছি সত্রত মহোৎসব। পিপলিবাৰী বাইজৰ দ্বাৰা পাচদিনীয়া পালনাম মহোৎসব।
  
  
   ১১-দিঘ ৮।৩০।১০ যোৱাত অম্বুবাচী নিবৃত্তিঃ। বিহিমপুৰ সত্ৰত মেবেলা আতাৰ শুকদ'ল বৰবৰী শলগুৰী সত্ৰৰ ডেকা সত্ৰাধিকাৰ লক্ষীকান্ত মহন্তৰ তিঃতিঃ। 
   
   ১২-ধর্মাচার্য্য সিদ্ধিনাথ দেব অধিকাৰীৰ সুন্দৰীদিয়া, গুবাকুছি কেকান জয়সাগব বামুনবৰীত, অৰুণ প্রভা দেৱী আৰু বিহিমপুৰ সত্ৰত গোবিন্দ আতাৰ তিঃতিঃ। 
   
   ১৩-পাটিকাৰা গাঁৱৰ বিশিষ্ট সমাজকর্মী চাক চন্দ্র শর্ম্মাৰ তিঃতিঃ।
   
   ১৫- হুল দিৱস। ব্যাঙ্কৰ ষান্মাসিক হিচাব।
   
   ১৬- বথ দ্বিতীয়া, শ্রীশ্রীজগন্নাথ দেবৰ ৰথযাত্রা। বৰজুলি গাঁৱত গীতা নিকেতন উৎসর।
   
   ১৭-দিহিং সত্ৰত বৃন্দাবন আতাৰ তিঃতিঃ।২০-আউনীআটি সত্ৰত সত্ৰাধিকাৰ হেমচন্দ্র গোস্বামীৰ তিঃতিঃ।
   
   ২১-রূপনাৰায়ণ খামোচীয়া সত্ৰত কৃষ্ণকান্ত অধিকাৰ, আউনীআটী সত্ৰত সত্ৰাধিকাৰ বিষ্ণুদের গোস্বামীব তিঃতিঃ।
   
    ২৩-কপাহেবা আহঁতগুবী সত্ৰৰ ভুৱনচন্দ্র গোস্বামী আৰু বাংশবাৰী সত্রত নীলকণ্ঠ গোস্বামীৰ তিঃতিঃ। 
   
   ২৪-স্মার্ত্ত মতে ও উৎকলমতে শ্রীশ্রীজগন্নাথ দেবব পূর্ণযাত্রা। বজালী ডুমুৰীয়া গীতা সত্ৰৰ প্ৰতিষ্ঠা দিৱস। নগৰীয়া সত্ৰত আদি পুৰুষ সনাতন আতা, বিহামপুৰ গাৱঁৰ পুষ্প কান্ত দেব শর্মা আৰু ধোপাবৰ নাচনীপাৰ হেমাবৰী কহুৱাতলি সত্ৰত ৰামকৃষ্ণ দেবৰ তিঃতিঃ।
   
    ২৫-বুদবাৰী সত্ৰৰ নাৰায়ণ কৃষ্ণ, বিজয় মাহাৰা সত্ৰৰ ভূবন চন্দ্র দেব সত্ৰাধিকাৰ গোস্বামী কমলাবাৰী সত্ৰত ভকত দাস আতা, পানীটেমা গাঁৱৰ সত্ৰাধিকাৰ থানুবাম কলিতাৰ তিঃতিঃ। ইদুজ্জোহা (বক্সিদ)।
    
     ২৬-কমলাবাৰী সত্রত লক্ষীকান্ত গোস্বামী, তাড়াবড়ি কালাশিলা সত্রত শুভকান্ত আতা, সৰু বাহজেডনী সত্ৰত ৰতীকান্ত দেব গোস্বামী, বিহামপুৰ (নলবাৰী) সত্ৰত বলদের গোস্বামীৰ আৰু খুদীয়া সত্ৰত 'লক্ষ্মী গোস্বামী, বংদৈ পটীয়ৰী সত্রত উমাকান্ত গোস্বামী, মাজুলী চামগুৰি সত্ৰৰ বংশী দাস আতাৰ তিঃতিঃ। 
     
     ২৭- শিৱসাগৰ শিমলুগুৰিৰ কহিত চন্দ্র চাংকাকতি, আউনীআটী সত্রত লীলাকান্ত গোস্বামী, কুরুবাবাহী সত্রত যদুচন্দ্র গোস্বামী, নৰসিংহ এলেভি সত্ৰত গোবিন্দ দেব, সনাতন দেব আৰু বৰপথাৰ দিচিবগণ সত্ৰত হেমেশ্বৰ দেৱ গোস্বামীৰ তিঃতিঃ। 
     
     ২৮- গুরু পূর্ণিমা। সন্ধিয়া শ্রীশ্রীসত্যনাবায়ণ ব্রত। শ্রীশ্রীনবোরা কুজি সত্ৰৰ দশমজনা সত্ৰাধিকাৰ ভূবন চন্দ্র দেব গোস্বামী আতাব তিঃতিঃ। নেপালী কবি ভানুভক্ত আচাৰ্য্যৰ জন্ম দিৱস। ব্যাস পূর্ণিমা। যোগী সেনা অসম নাথ যোগী সম্প্রদায়ব জাতীয় উৎসর গুরু পূর্ণিমা পালন।
     
      ২৯-বৰপেটা ধামত বামতাবণ আতৈ, বৰপেটা সত্ৰত বলাই বুঢ়া আতাৰ তিঃতিঃ।
      
      ৩২-সন্ধিয়া শ্রীশ্রীসত্যনাবায়ন ব্রত।

ৰবিশুদ্ধি-মেষ সিংহ কন্যা আৰু মকৰৰাশিৰ ১৩ তাৰিখৰ পৰা মেষ বৃষ সিংহ তুলা মকৰ আৰু

কুম্ভবাশিব।</li>
    </ul>

     </>
  )
}
