import React from 'react'
import './Try.css'



export default function Calneder1() {


  const customDays = [
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },
    { day: '', content: '', color: 'white' },

    { day: '১', content: '15 april', color: 'white' },
    { day: '২', content: 'april 16', color: 'white' },
    { day: '৩', content: 'april 17', color: 'white' },

    { day: '৪', content: 'april 18', color: 'white' },
    { day: '৫', content: 'april 19', color: 'white' },
    { day: '৬', content: 'april 20', color: 'white' },
    { day: '৭', content: 'april 21', color: 'white' },
    { day: '৮', content: 'april 22', color: 'white' },
    { day: '৯', content: 'april 23', color: 'white' },
    { day: '১০', content: 'april 24', color: 'white' },
    { day: '১১', content: 'april 25', color: 'white' },
    { day: '১২', content: 'april 26', color: 'white' },
    { day: '১৩', content: 'april 27', color: 'white' },
    { day: '১৪', content: 'april 28', color: 'white' },
    { day: '১৫', content: 'april 29', color: 'white' },
    { day: '১৬', content: 'april 30', color: 'white' },
    { day: '১৭', content: 'may 1 ', color: 'white' },
    { day: '১৮', content: 'may 2', color: 'white' },
    { day: '১৯', content: 'may 3', color: 'white' },
    { day: '২০', content: 'may 4', color: 'white' },
    { day: '২১', content: 'may 5', color: 'white' },
    { day: '২২', content: 'may 6', color: 'white' },
    { day: '২৩', content: 'may 7', color: 'white' },
    { day: '২৪', content: 'may 8', color: 'white' },
    { day: '২৫', content: 'may 9', color: 'white' },
    { day: '২৬', content: 'may 10', color: 'white' },
    { day: '২৭', content: 'may 11', color: 'white' },
    { day: '২৮', content: 'may 12', color: 'white' },
    { day: '২৯', content: 'may 13', color: 'white' },
    { day: '৩০', content: 'may 14', color: 'white' },
    { day: '৩১', content: 'may 15', color: 'white' },


    // ... Add more days as needed
  ];
  return (

    <>
        <div>

        <div className="month"
    style={{
    backgroundImage: `url(${require('./Asset/lachit.jpg')})`,
    backgroundRepeat: 'no-repeat',
    backgroundSize: 'cover',
  }}
>
     

    
       <ul>
         
         <li>
         জেঠ(April-May)<br />
           <span style={{ fontSize: '18px' }}>2023-24</span>
         </li>
       </ul>
     </div>

     <ul className="weekdays">
       <li>দেওবাৰ</li>
       <li>সোমবাৰ</li>
       <li>মঙলবাৰ</li>
       <li>বুধবাৰ</li>
       <li>বৃহস্পতিবাৰ</li>
       <li>শুকুৰবাৰ</li>
       <li>শনিবাৰ</li>

     
     </ul>

     <ul className="days">
       {customDays.map(({ day, content, color }) => (
         <li key={day} style={{ backgroundColor: color }}>
           {day}
           <div>{content}</div>
         </li>
       ))}
     </ul>
   </div>


    
    
   
      

      

    <ul className='content'>
      <li>
        ১-নগাঁও কৰতিপাব নসত্ৰৰ সত্ৰাধিকাৰ পূর্ণচন্দ্র গোস্বামীৰ তিঃতিঃ। খামাৰপাৰ কালী মন্দিবতবার্ষিক হোমযজ্ঞ২১-মহাপুরুষ শ্রীশ্রীমাধরদেরব আবির্ভাব তিথি। মাধরদেবাব্দ ৫৩৪ আৰম্ভ। পাটবাউসীত গোবিন্দদের মিশ্র, মেলেং গ্রান্ট চিপহা সত্ৰাধিকাৰ গহণ চন্দ্র গোস্বামী আকনগাঁও বুঝবাবাহী সত্ৰৰ ধৰ্ম্মপ্রানা সত্রাধিকারিণী আই হিবন্ময়ীৰ তিঃতিঃ। আজিৰ পৰা ১২ জুনলৈ পাৰিপার্শ্বিক সপ্তাহ পালন। 
      </li>
      <li>২- -সাবিত্রী চতুৰ্দ্দশী ব্রত। সন্ধিয়া সাবিত্রী সত্যবান আক ধৰ্ম্মবাজ পূজা। </li>
      <li> ৪-জাগৰা কৈহাটি মালোৰী বহুবী বালিসত্র আদিত মহাপুৰুষ শ্রীশ্রী হবিদেবব তিথি উৎসর। আজিৰ পৰা ৭দিন ব্যাপি চামতা পাটোৱাৰী চুপাৰ বাৰ্ষিক পালনাম আবস্ত।</li>
      <li> ৫-মাল্লীবাৰী সত্ৰতবাসুদের আতা, জ্যোতিষী সংস্কৃত পণ্ডিত পুৰুষোত্তম ভট্টাচাৰ্য্যৰ তিতিঃ। থেকেৰাগুৰিত শ্রীশ্রীবিষ্ণুমেলা উদযাপন।৮-শ্রবনী সত্রব কৃষ্ণ পবন দেব তিঃতিজ্ঞ। শিমলুগুৰীয়া অধ্যাপক মহীৰাম ভট্টাচাৰ্য্য বিদ্যাবত্ব দেৱৰ তিঅতিঃ।</li>
      
      <li>৬-লোকনাথ ব্রহ্মচাৰীৰ তিঃতিঃ ।</li>
      <li>১০-জোৱাই ষষ্ঠী। পাঠশালা জ্যোতিনগৰ নামঘৰত দিনজোৰা নামকীর্ত্তন উৎসব।</li>
      <li>১২-সুন্দৰীদিয়াৰ পণ্ডিত প্ৰবৰ গোপীকান্ত বেদান্তৰত্ন, শ্রবনী সন্ত্রত জয়দের মহন্তবৰএলেডী সত্ৰৰ পদ্মকান্ত আতা, নলবাৰী সন্ধেলীৰ বোহিনী দেব, পঞ্চবর্তী বাৰপূজীয়াআহঁতগুবি সত্ৰৰ বুঢ়াভকত তিহকৰ বৰুবা (ভালুকমাবি) বতিংতিঃ। দেউবী পাবার আইথানত দুদিনীয়া মেলা উৎসব। পণ্ডিত জৱাহৰলাল নেহৰুৰ স্মৃতি দিবস।</li>
      <li>১৪-বৰঠাই নগৰীয়া সত্রত পূর্ণানন্দ গোস্বামী, ধোপাবৰ সত্ৰত সত্ৰাধিকাৰ গজেন্দ্র নাৰায়ণ আতা, নগাঁও নবোরা বালিসত্র আক গুরাহাটী বাপনগৰৰ থানেশ্বৰ দের গোস্বামীৰ তিঃতিঃ। </li>
      <li> ১৫-দশহবা, শ্রীশ্রীগঙ্গা আৰু মনসা দেবী পূজা। বটদ্রবা আইভেটী সহত গোপাল চন্দ্রদেবৰ তিঃতিঃ। </li>
      <li> ১৬-করপেটা সত্রত মথুরা দাসবুন আতাব জন্মোৎসর। চিপহা সত্ৰত বামধন গোস্বামী, নগাঁর মাজজাজবিৰ যোগেন্দ্র নাথ শৰ্ম্মা শ্রবনী সত্ৰাধিকাৰ নন্দকান্ত মহন্ত, বটদ্রবা আইভেটি সত্রত গোপালদের আতাব, নমাটি কাটনীপাব সত্রত যুগদের অধিকাৰ, পুষ্পচন্দ্র গোস্বামী আৰু গৌৰীকান্ত আতাব তিঃতিঃ। আজিৰ পৰা ২২ জেঠলৈ মহাপ্রভু শ্রীশ্ৰীগৰখীয়া গোসাই থানত জাগবণ উৎসব।</li>
      <li>১৭-নবমাটী কাটনীপাৰ সত্ৰৰ সত্ৰীয়া শিল্পী ধৰ্ম্মগুক মহেন্দ্র নাথ মহন্ত,বাজিয়া গাওঁ গজলা মদাৰগুৰি সত্ৰত সোমেশ্বৰ দেব মহন্তব তিঃতিঃ। ধলৰ সত্ৰত বৃন্দাবন আতা, আৰু টোবৰীয়া সত্ৰত আনন্দ চন্দ্ৰ অধিকাৰীৰ তিঃতিঃ। </li>
      <li>। ১৮-বৰপেটা সত্রত পূর্ণানন্দ আতৈ, উত্তন কমলাবাৰী সত্ৰাধিকাৰ বিষ্ণুদের গোস্বামী, বৰঙা কাঠবাপু সত্রত কৃষ্ণবাবু মহন্ত্র, মাজুলী চামগুৰিৰ বংশীধব দেব আতা, চৰাইবাহী সত্রব কনক চন্দ্র মহন্তর তিঃতিঃ। যোৰহাটৰ ৰত্নাকৰ সত্ৰৰ পদ্মনাথ দের গোস্বামী আৰু চৰাবড়ী সত্রব ডেকা সত্রাধিকাব পবিত্র মোহন অধিকাৰৰ তিঃতিঃ।</li>
      <li> ১৯-সন্ধিয়া শ্রীশ্রীসত্যনাবায়ন ব্রত। দক্ষিণপাট সত্রত কৃষ্ণকান্ত দের, দিহিং নমটি সত্রত (নাজিবা) লক্ষ্মীকান্ত দের, বহা মহাদের থানৰ বগৰীগুবি মিশ্র সত্ৰত নবেম্বৰ দের গোস্বামী আক তিতাবৰ চিপহা সত্ৰৰ ভবনাথ দেব, দীঘলকুছি সত্ৰত পানুৰাম বুঢ়া আতা আউনীআটী সত্ৰাধিকাৰ দেবদত্তদের আক বেলশৰ ন-সত্ৰত জয়চন্দ্র গোস্বামীৰ তিতিঃ। কালকাৰ সত্ৰত মিটনীত জগন্নাথব নামকীর্তন। ৰাভা সকলৰ বায়খো পূজা। বাথৌ পূজা পাহাম।</li>
      <li> ২০-বাভা সকলৰ বায়খো পূজা। বাথৌ পূজা পাহাম দিহিং সত্রত বল্লভ চন্দ্র দেৱৰ অিতিঃ। </li>
      <li>২২- মাজুলী হালধীআটী সত্রত মহাদের, নৰোৱা বালিসত্ৰত ধরলচন্দ্র দের গোস্বামী, শুকদ'ল বৰুবড়ি শলগুৰী সত্রব অপৰাজিতা বৰা উলুবনী কলিয়াবৰৰ ৰূপনাৰায়ণ খামুচিয়া সত্ৰৰ সত্ৰাধিকাৰ দত্তদের গোস্বামীৰ তিঃতিঃ। </li>
      <li> ২৪- লেটুগ্রাম সত্ৰাধিকাৰ গুনহৰি আতা আৰু মাহাৰা সত্ৰৰ সত্ৰাধিকাৰ মহেশ্চন্দ্র গোস্বামীৰ তিঅতিঃ। ননবাৰ বৰবকুল তলত মনসা পূজা উৎসব। </li>
      <li>২৫-ধাইগাঁও কৃষ্ণাইব্রহ্মাযজ্ঞ মন্দিবৰ প্রতিষ্ঠাতা মৎ নিত্যানন্দ ব্রহ্মচাৰীৰ তিতিঃ।</li>
      <li>২৭- -গৌৰীপুৰৰ শ্রীমৎ নিত্যানন্দ ব্ৰণাচাৰী, মুনীন্দ্র নাৰায়ণ দত্তবকবাৰ তিঃতিঃ।</li>
      <li>২৯-কটৰা সত্ৰত দধিমঠন।৩০-বেলগুবি সত্রত শ্রীশ্রীমাধবদেরব জন্ম উপলক্ষে নামঘোষা পাঠ।</li>
      <li> ৩২-সন্ধিয়া শ্রীশ্রীসত্যনাৰায়ন ব্রত। পাতিদবং অর্জনাবীশ্বব শিবমন্দিৰত জাগাৰ পূজা।</li>
      
    </ul>
    
     </>
  )
}
