import React from 'react'

export default function Calneder1() {
  

  const customDays = [
    { day: '', content: '', color: 'white' },
    

    { day: '১', content: 'Dec 18', color: 'white' },
    { day: '২', content: 'Dec 19', color: 'white' },
    { day: '৩', content: 'Dec 20', color: 'white' },

    { day: '৪', content: 'Dec 21 ', color: 'white' },
    { day: '৫', content: 'Dec 22', color: 'white' },
    { day: '৬', content: 'Dec 23', color: 'white' },
    { day: '৭', content: 'Dec 24', color: 'white' },
    { day: '৮', content: 'Dec 25', color: 'white' },
    { day: '৯', content: 'Dec 26', color: 'white' },
    { day: '১০', content: 'Dec 27', color: 'white' },
    { day: '১১', content: 'Dec 28', color: 'white' },
    { day: '১২', content: 'Dec 29', color: 'white' },
    { day: '১৩', content: 'Dec 30', color: 'white' },
    { day: '১৪', content: 'Dec 31', color: 'white' },
    { day: '১৫', content: 'jan 1', color: 'white' },
    { day: '১৬', content: 'jan 2', color: 'white' },
    { day: '১৭', content: 'Jan 3 ', color: 'white' },
    { day: '১৮', content: 'Jan 4', color: 'white' },
    { day: '১৯', content: 'Jan 5', color: 'white' },
    { day: '২০', content: 'Jan 6', color: 'white' },
    { day: '২১', content: 'Jan 7', color: 'white' },
    { day: '২২', content: 'Jan 8', color: 'white' },
    { day: '২৩', content: 'Jan 9', color: 'white' },
    { day: '২৪', content: 'Jan 10', color: 'white' },
    { day: '২৫', content: 'Jan 11', color: 'white' },
    { day: '২৬', content: 'Jan 12', color: 'white' },
    { day: '২৭', content: 'Jan 13', color: 'white' },
    { day: '২৮', content: 'Jan 14', color: 'white' },
    { day: '২৯', content: 'Jan 15', color: 'white' },
    


    // ... Add more days as needed
  ];
  return (
    <div>
       <div>
     
       <div className="month"
    style={{
    backgroundImage: `url(${require('./Asset/handloom.jpg')})`,
    backgroundRepeat: 'no-repeat',
    backgroundSize: 'cover',
  }}>
       <ul>
        
         <li>
         পুহ (Dec-Jan)<br />
           <span style={{ fontSize: '18px' }}>2023-24</span>
         </li>
       </ul>
     </div>

     <ul className="weekdays">
       <li>দেওবাৰ</li>
       <li>সোমবাৰ</li>
       <li>মঙলবাৰ</li>
       <li>বুধবাৰ</li>
       <li>বৃহস্পতিবাৰ</li>
       <li>শুকুৰবাৰ</li>
       <li>শনিবাৰ</li>

     
     </ul>

     <ul className="days">
       {customDays.map(({ day, content, color }) => (
         <li key={day} style={{ backgroundColor: color }}>
           {day}
           <div>{content}</div>
         </li>
       ))}
     </ul>
   </div>
       
    <ul>
        <li>
        ১-হালধীআটী সত্রত দীপুকান্ত গোস্বামী, কৰতিপাৰা সত্ৰত বিশ্বেশ্বৰ গোস্বামী, কুবালগুৰীত মুকলিমুৰীষা গোস্বামী কৃষ্ণচন্দ্র গোস্বামী, নগাঁও মাজজাজবি শ্রীশ্রী বাঘমবা বজালবাৰি সত্ৰৰ ডেকা সত্ৰাধিকাৰ ৰত্নেশ্বৰ গোস্বামী আৰু মাজজাজৰি মাজুভাগ আহঁতগুবি সত্রৰ ডেকা সত্রীয়া সদানন্দ গোস্বামীৰ তিঃতিঃ। ২-পূৰণীগুদাম লেটুগ্রাম সত্ৰত সত্ৰাধিকাৰ মুক্তিচন্দ্র মহন্ত, বৰঙাবাৰীত তোষণ মহন্তৰ তিঃতিঃ। আজিৰ পৰা ২ জানুৱাৰীলৈ অসমীয়া জাতীয় জীবন সংগঠন পষেক পালন। জাতীয় চেতনা দিবস।৩-অভয়াপুৰীৰ কনক চন্দ্ৰ শৰ্ম্মা, শুকদ'ল সকবৰী শলগুৰী সত্ৰত সত্ৰাধিকাৰ মহীকান্ত মহন্ত আৰু চকলাঘাট খৌবামোচৰ সত্রৰ যোগমায়া গোস্বামীৰ তিঃতিঃ ।৪-কাংসপাৰ সত্ৰত সুন্দৰ কানু দেবৰ তিঃতিঃ। গোৱালপাৰা গোবিন্দপুৰত হাছানীয়া খানকাহ শ্বৰীফত ঔৰচ শ্বৰীফ।৬-ভোগপুৰ সন্ত্রত বিষ্ণুদেব গোস্বামী, মৰিয়নী ভেলেগুৰী উলুতলী সরত হেমকান্ত মহন্তৰ তিঃতিঃ।৭-হাতীচোং শুকদচল শলগুৰী সত্ৰত কেশবকান্ত অধিকাৰ আৰু গণকপুখুৰী লেটুগ্রাম সত্ৰাধিকাৰ দেবকান্ত মহন্তৰ তিঃতিঃ ।৮-

দীঘলবড়িত ভিতৰসেবা পূজা উৎসব। কোকৰাঝাৰ ৰামকৃষ্ণ আশ্রমত মা সাবদাশ্রিত স্বামী অপর্ণানন্দ মহাৰাজৰ অবির্ভাব তিথি। খৃষ্ট ম্যাচ ই। আদি মিছিং ভাগবতী সংঘৰ কুলওক শ্রীশ্রীব্রহ্ম বেদান্তি বমানন্দ দেবৰ গুৰু বিজয়পর্ব্ব আবস্তু ।৯-খুষ্ট ম্যাচ ডে (ববদিন) ।১০-পাটবাউসী বিহিমপুৰ বাৰাদি, বঙাপানী, কনবা সত্ৰ গভিয়া, বিষ্ণুপুৰ বটদ্ৰবা ধামত চতুর্ভুজ ঠাকুৰ, মাজুলী আহত গুৰি বৰসত্ৰৰ সত্ৰাধিকাৰ বিষ্ণুনাৰায়ণ দেব গোস্বামীৰ তিঃতিঃ।১১- বিহিমপুৰ সত্ৰৰ তিলকচন্দ্র আতা আৰু মাজুলী চামগুৰি সত্রৰ ৰামচন্দ্র আতা তিঃতিঃ। অসম সাহিত্য সভা প্রতিষ্ঠা দিবস। গোৱালপৰীয়া লোকগীতৰ অপ্রতিদন্দী শিল্পী প্রতীমা সকরা পাণ্ডেৰ স্মৃতি দিবস।১২-দক্ষিণ কামরূপ কাঁহিকুছিৰ বিশিষ্ট জ্যোতিষী জগন্নাথ দেব শর্মা, আহতগুৰী সত্ৰত ৰামগোপাল গোস্বামী, মধুমিশ্র সম্রাধিকার বিশ্বনাথ গোস্বামী, চানমারী পূর্ব্বাচলৰ সমাজ সেবক শম্ভুনাথ ভট্টাচার্য্য আৰু বৰএলেডি সমত মহেন্দ্র নাথ আতাব তিঃতিঃ। বেলগুৰি সত্ৰত গহপুৰ কীৰ্ত্তন মহোৎসব।১৩-বিচিত্র নাৰায়ণ দত্তবকরা আৰু বৰহোলাৰ ৰঙনাখাত গুজলা সত্ৰত ডিম্বেশ্বৰ মহন্তৰ তিঃতিঃ ।১৪-দক্ষিণপাট সত্রত অধিকাৰ নাৰায়ণ গোস্বামী আৰু মাজুলী হালবি আটী সত্রত শিরনাথ আতাব তিঃতিঃ ।১৫-আল্লিবাৰী সরত যজ্ঞন্যবায়ণ গোস্বামীৰ তিঃতিঃ ।১৬-বিষ্ণু বালিকুছি দিনঞ্জয় সত্রত অনিৰুদ্ধ দেব আকবজালী বাঘমাৰাৰ ডাঃ চন্দ্রমোহন শৰ্ম্মাব তিঃতিঃ। ইংৰাজী নতুন বছৰ ২০২৩ আবঃ।১৭- ডিব্রুগড়ত পৰম পুৰুষোত্তম প্রসিদ্ধ চন্দ্র দেব দুর্নীৰ গজেন শইকীয়া আৰু নগাঁও মাজভাজবি শ্রীশ্রী বাঘমৰা বজালবাৰি সত্ৰৰ ধৰ্ম্মপ্রানা আই মঞ্জুরী গোস্বামীব তিঃতিঃ। বাষ্ট্রীয় যুব দিবস।১৮- হালধী আটী সত্ৰৰ সেবকান্ত মহন্ত, শিৱসাগৰ কোৱামৰা সত্রত অকণ চন্দ্র মহন্ত, কলমৌবাৰীৰ ভবেন বৰা আৰু উত্তৰ লক্ষীমপুৰ দাংধরা সরব সত্ৰাধিকাৰ কমল মহন্তৰ তিঃতিঃ। ভাৰত সেবাশ্রম সংঘব প্রতিষ্ঠাতা শ্রীমৎ স্বামী প্রণবানন্দজীৰ তিথি।১৯-গন্ধিয়াৰ জ্যোতিষী বিধুভূষণ ভট্টাচার্যাৰি তিঃতিঃ। ২০-কালাই গাওঁ মাধব জনকল্যাণাশ্রমত পাৰপাৰ কৃষ্ণপুৰী সত্ৰত বৈষনাচার্য্য কৃষ্ণপুৰী গোসাইপ্রভৃৰ তিথি উৎসব, বেঙেনাআটী সত্রত কেশবানন্দ গোস্বামীৰ তিঃতিঃ।২১- সন্ধিয়। শ্রীশ্রীসত্যনাৰায়ন ব্রত। পাটবাউসী শঙ্কৰদের থানৰ কামালী দের মিশ্রৰ তিঃতিঃ। বঙাইগাওঁ ২য় খণ্ড ঘোবাগাঁৱৰ শ্রীশ্রীগণেশ মন্দিবত অখণ্ড নামযজ্ঞ। বাতা হাচাং তথা দুধনৈ দেউবীপাৰা বাদর্শী মৌজাৰ আই থখনত মা শ্রীশ্রীভগবর্তী দেবীৰ ৪ দিন ব্যাপিত পূজা। ২৩-বঙামাটি পাহাৰৰ দুধকুবৰী থানত আৰু শ্রীশ্রীকামাখ্যাৰ পুংসবন। ২৫-লক্ষীমপুৰ আদি এলেডি সত্রব শেষ চন্দ্র গোস্বামীর তিঃতিঃ। ২৬ কমলাবাৰী ভোগপুৰ সত্ৰত বুঢ়া দামোদৰৰ তিঃতিঃ।২৭- পাঠশালা মুণ্ডৰীয়াৰ সংস্কৃত পণ্ডিত হৰগোবিন্দ শর্মা, বাবাদি ৰঙাপানী জনীয়া কনবা সত্রত দীননাথ শর্মা দলৈ, নাৰায়ন দাস ঠাকুৰ আতা, বংদৈ পটিয়ৰী সরত উমাকান্ত গোস্বামী, চকলাঘাট খৌৰামোচৰ সত্ৰৰ হেমলতা গোহাম। আৰু দেৰগাঁও ন-গোঁসাই সত্রত নবেন্দ্র বল্লভ গোস্বামীৰ তিঃতিঃ। স্বামী বিবেকানন্দর জন্ম দিবস। দুধনৈ টিলাপানা নবগ্রহ ধাম ক্ৰিনয়ন ব্ৰহ্ম মন্দিৰ প্রতিষ্ঠা দিৱস ২১ ল্যাসকুছি সৰভোগ নমাটি বজালী আৰু পাটবাউসী ধলব সন্নত শ্রী' ভট্টদেবৰ, এলেঙি নৰসিংহ সত্ৰত গোবিন্দ দেবৰ তিঃতিঃ। বাতি উককা মহোৎসর।৩০- সন্ধিয়া শ্রীশ্রীসতানাবায়ণ ব্রত। হালখতি। মকৰাদিয়ান। মেজিদাহ। সূর্যাগ্নি পূজা। মাঘ বিহু। চকলাঘাট খৌৰামোচৰ সত্ৰৰ মহেশ চল গোস্বামীৰ তিঃতিঃ। ব্যাসপাৰা পাৰিজাত দেবালয়ত মহোৎসব। বশিষ্ঠাশ্রমত মহামেলাৰত্ন। হাজোৰ হয়গ্রীব মায়ব দেবালয়ত বুল-বুলি যুজ। সৰ্থেবাৰীন সত্রত কৃষ্ণ গুরু সেবাশ্রমত অখণ্ড পালনাম আৰম্ভ। মুখদিৰ সভা। বাকঘৰীয়া বাৰগোপাল থানত পাচদিনীয়া ভোগালী মহোৎসব। to be added
        </li>
    </ul>

    </div>
  )
}
